











// 3.	Реализовать аналог библиотеки Math (можно назвать MathX) с базовым набором функций, используя замыкания:
//     вычисление N-го числа в ряду Фибоначчи Ф вычисление всех чисел в ряду Фибоначчи до числа N вычисление N-го просто числа вычисление всех простых чисел до числа N
//     Аналог библиотеки Math:
// 1) Вычисление N-го числа в ряду Фибоначчи
// 2) Вычисление всех чисел в ряду Фибоначчи
// 3) Вычисление N-го простого числа
// 4) Вычисление всех простыx чисел до N
//
// Будет плюсом, если задумаетесь и об оптимизации.
